R1:

Router>enable
Router#
Router#configure terminal
Router(config)#interface GigabitEthernet0/0/1
Router(config-if)#ip address 192.20.10.1 255.255.255.0
#no shutdown
Router(config)#interface GigabitEthernet0/0/0
Router(config-if)#ip address 172.168.10.100 255.255.0.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#exit

Router#en
Router#conf t
Router(config)#ip route 20.0.0.0 255.0.0.0 192.20.10.2

R2:

Router>enable
Router#
Router#configure terminal
Router(config)#interface GigabitEthernet0/0/1
Router(config-if)#ip address 192.20.10.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0/0
Router(config-if)#ip address 20.0.0.100 255.0.0.0
Router(config-if)#no shutdown

Router#en
Router#conf t
Router(config)#ip route 172.168.10.0 255.255.255.0 192.20.10.1	
Router(config)#ip access-list standard 30
Router(config-std-nacl)#permit 172.168.10.2 0.0.0.0
Router(config-std-nacl)#exit
Router(config)#ip access-list standard 30
Router(config-std-nacl)#deny 172.168.10.1
Router(config-std-nacl)#exit
Router(config)#int gig0/0/0
Router(config-if)#ip access-group 20 out
Router(config-if)#exit
Router(config)#exit

Output:

Router#show ip access-list
Standard IP access list 30
    10 permit host 172.168.10.2
    20 deny host 172.168.10.1
